tutorials/incompressible/simpleSolver/ras/ACCM_backwardFacingStep2D/0/k
/*---------------------------------------------------------------------------*\
Caelus 9.04
 Web:      www.caelus-cml.com 
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.2945755;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.2945755;
    }
    outlet
    {
        type            zeroGradient;
    }
    symm-left
    {
        type            empty;
    }
    symm-right
    {
        type            empty;
    }
    top-wall
    {
        type            kqRWallFunction;
        value           uniform 0.2945755;
    }
    upstream
    {
        type            symmetryPlane;
    }
    wall
    {
        type            kqRWallFunction;
        value           uniform 0.2945755;
    }
}


// ************************************************************************* //
