tutorials/incompressible/simpleSolver/ras/ACCM_backwardFacingStep2D/system/fvSolution
/*-------------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*------------------------------------------------------------------------------*/
FoamFile
{
        version                         2.0;
        format                          ascii;
        class                           dictionary;
        location                        "system";
        object                          fvSolution;
}

//------------------------------------------------------------------------------

solvers
{
        p
        {
            solver                      PCG;
            preconditioner              SSGS;
            tolerance                   1e-8;
            relTol                      0.01;
        }
        U
        {
            solver                      PBiCGStab;
            preconditioner              USGS;
            tolerance                   1e-7;
            relTol                      0.01;
        }

        "(k|omega|nuTilda|epsilon)"
        {
            solver                      PBiCGStab;
            preconditioner              USGS;
            tolerance                   1e-08;
            relTol                      0;
        }
}

SIMPLE
{
        nNonOrthogonalCorrectors        1;
        pRefCell                        0;
        pRefValue                       0;
}

relaxationFactors
{
    	p                               0.3;
    	U                               0.3;
        nuTilda                         0.5;
        k                               0.5;
        omega                           0.5;
        epsilon                         0.5;
}
